Show / Hide Table of Contents
Class ProjectItem
Identification of an item in the Idea project
Inheritance
System.Object
ProjectItem
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[DataContract]
public class ProjectItem
Properties
Improve this Doc   View Source
Identifier
Id of the item in the idea project
Declaration
[DataMember]
public int Identifier { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Name of the item in the idea project
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source